---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewTypeSchedules
source: html/084405ef-04e3-bbc2-598a-1ca60f1f297b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewTypeSchedules Property

"Type"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewTypeSchedules { get; }
```